src/InformationRegisters/кфкИсходящиеСообщения/кфкИсходящиеСообщения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>кфкИсходящиеСообщения</name>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.кфкСтатусыСообщений</types>
    </type>
  </resources>
  <resources>
    <name>ИсходныеДанные</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>ЭтоУдаление</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КлючСообщения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Заголовки</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>ТелоСообщения</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <attributes>
    <name>Продюсер</name>
    <type>
      <types>CatalogRef.кфкПродюсеры</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбъект</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>120</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипИсходныхДанных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>120</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КлючОбъекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СобытиеРегистрации</name>
    <type>
      <types>EnumRef.кфкСобытияРегистрации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРегистрации</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОбработки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыгрузки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДлОбработкиМС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекстЖурнала</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>МеткаИзмененияМС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>КлючЗаписи</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаРегистрацииМС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/кфкИсходящиеСообщения/Forms/ФормаЗаписи/Module.bsl
// @strict-types

#Область ОписаниеПеременных

&НаКлиенте
Перем РедакторJSON; // ВнешнийОбъект

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Параметры.Ключ) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ТолькоПросмотр = Истина;
	
	Элементы.ДлОбработкиМС.ФорматРедактирования = ?(ЗначениеЗаполнено(Запись.ДатаОбработки), "ЧН='<1';", "ЧН=;");
	
	АдресРедактораJSON = ПоместитьВоВременноеХранилище(ПолучитьОбщийМакет("кфкJSONEditor"));
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// ИсходныеДанные
	ИнициализироватьИсходныеДанные(ТекущийОбъект);
	
	// ТелоСообщения
	ТелоСообщения = кфкОбщегоНазначенияСлужебный.ЗначениеИзХранилища(ТекущийОбъект.ТелоСообщения); // Строка
	Если Не ПустаяСтрока(ТелоСообщения) Тогда
		Элементы.СтраницаТелоСообщения.Доступность = Истина;
		АдресТелаСообщения = ПоместитьВоВременноеХранилище(ТелоСообщения);
	Иначе
		Элементы.СтраницаТелоСообщения.Доступность = Ложь;
		
	КонецЕсли;
	
	// Заголовки
	Заголовки.Очистить();
	ЗаголовкиИБ = кфкОбщегоНазначенияСлужебный.ЗначениеИзХранилища(ТекущийОбъект.Заголовки); // Неопределено, Соответствие Из КлючИЗначение
	Если ЗаголовкиИБ <> Неопределено Тогда
		Для Каждого КлючЗначение Из ЗаголовкиИБ Цикл
			ЗаполнитьЗначенияСвойств(Заголовки.Добавить(), КлючЗначение);
		КонецЦикла;
	КонецЕсли;
	Элементы.СтраницаЗаголовки.Доступность = Заголовки.Количество() > 0;
	
	// ТекстЖурнала
	Элементы.СтраницаТекстЖурнала.Доступность = Не ПустаяСтрока(ТекущийОбъект.ТекстЖурнала);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ИнициализироватьРедакторJSON();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СтраницаРедактораJSONДокументСформирован(Элемент)
	
	Если РедакторJSON = Неопределено Тогда
		//@skip-check property-return-type
		//@skip-check dynamic-access-method-not-found
		РедакторJSON = Элемент.Документ.defaultView.Init(); // ВнешнийОбъект
	КонецЕсли;
	
	//@skip-check property-return-type
	РедакторJSON.menu.style.backgroundColor = "#d0d0d0";
	//@skip-check dynamic-access-method-not-found
	РедакторJSON.focus();
	
	ТелоСообщения = ПолучитьИзВременногоХранилища(АдресТелаСообщения); // Строка
	//@skip-check dynamic-access-method-not-found
	РедакторJSON.setText(ТелоСообщения);
	
	//@skip-check dynamic-access-method-not-found
	РедакторJSON.setMode("tree");
	
КонецПроцедуры

&НаКлиенте
Процедура РедакторJSONРежимТекстаПриИзменении(Элемент)
	
	//@skip-check dynamic-access-method-not-found
	РедакторJSON.setMode(?(РедакторJSONРежимТекста, "code", "tree"));
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбработатьСообщение(Команда)
	
	ОчиститьСообщения();
	
	Если Не ОбработкаДоступна() Тогда
		кфкИнтеграцияСлужебныйКлиент.СообщениеНедоступностиРучнойОбработки();
		Возврат;
	КонецЕсли;
	
	ОбработатьСообщениеНаСервере();
	
	ИнициализироватьРедакторJSON();
	
	ОповеститьОбИзменении(Запись.ИсходныйКлючЗаписи);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ОбработкаДоступна()
	Возврат (ПолучитьФункциональнуюОпцию("кфкБлокировкаИнтеграции")
				Или Не кфкФоновыеОперацииСлужебный.РегламентноеЗадание().Использование)
			И кфкФоновыеОперацииСлужебный.ПолучитьПотоки(СостояниеФоновогоЗадания.Активно).Количество() = 0;
КонецФункции

&НаСервере
Процедура ОбработатьСообщениеНаСервере()
	
	кфкФоновыеОперацииСлужебный.СериализацияСообщения(Запись.ИсходныйКлючЗаписи);
	
	Прочитать();
	
КонецПроцедуры

#Область ИнициализацияФормы

&НаКлиенте
Процедура ИнициализироватьРедакторJSON()
	
	Если Не (ПустаяСтрока(РедакторJSONСтраница)
			И ЭтоАдресВременногоХранилища(АдресТелаСообщения) И ЭтоАдресВременногоХранилища(АдресРедактораJSON)) Тогда
		Возврат;
	КонецЕсли;
		
#Если Не ВебКлиент Тогда
	
	Каталог = ОбщегоНазначенияКлиентСервер.ПолучитьПолноеИмяФайла(КаталогВременныхФайлов(), "kfkJSONEditor");
	РедакторJSONСтраница = ОбщегоНазначенияКлиентСервер.ПолучитьПолноеИмяФайла(Каталог, "index.html");
	
	Файл = Новый Файл(РедакторJSONСтраница);
	Если Не Файл.Существует() Тогда
		
		УдалитьФайлы(Каталог);
		СоздатьКаталог(Каталог);
		
		РедакторДД = ПолучитьИзВременногоХранилища(АдресРедактораJSON); // ДвоичныеДанные
		Поток = РедакторДД.ОткрытьПотокДляЧтения();
		ЧтениеZip = Новый ЧтениеZipФайла(Поток);
		ЧтениеZip.ИзвлечьВсе(Каталог);
		
	КонецЕсли;
	
#Иначе
	Элементы.СтраницаТелоСообщения.Доступность = Ложь;
#КонецЕсли

КонецПроцедуры

&НаСервере
Процедура ИнициализироватьИсходныеДанные(ТекущийОбъект)
	
	Если Не ПустаяСтрока(ИсхДанныеТип) Тогда // уже инициализировано
		Возврат;
	КонецЕсли;
	
	ИсходныеДанные = кфкОбщегоНазначенияСлужебный.ЗначениеИзХранилища(ТекущийОбъект.ИсходныеДанные); // ЛюбаяСсылка, Структура, СправочникОбъект, ДокументОбъект
	Если ИсходныеДанные = Неопределено Тогда
		Элементы.СтраницаИсходныеДанные.Доступность = Ложь;
		Возврат;
	КонецЕсли;
	
	Если ЭтоСтруктура(ТекущийОбъект.ТипИсходныхДанных) Тогда
		ЗаполнитьЗначенияИсхДанныхСтруктуры(ТекущийОбъект, ИсходныеДанные);
		
	Иначе
		ТипОбъект = СтрЗаменитьПоРегулярномуВыражению(ТекущийОбъект.ТипИсходныхДанных, "(Object|Ref|RecordSet)\.", ".", Истина);
		ОбъектМД = ОбщегоНазначения.ОбъектМетаданныхПоПолномуИмени(ТипОбъект); // Неопределено, ОбъектМетаданныхСправочник, ОбъектМетаданныхДокумент
		Если ОбъектМД <> Неопределено И ОбщегоНазначения.ЭтоОбъектСсылочногоТипа(ОбъектМД) Тогда
			ЗаполнитьЗначенияИсхДанныхОбъекта(ОбъектМД, ИсходныеДанные);
			
		ИначеЕсли ОбъектМД <> Неопределено И ОбщегоНазначения.ЭтоРегистрСведений(ОбъектМД) Тогда
			ЗаполнитьЗначенияИсхДанныхРегистра(ОбъектМД, ИсходныеДанные);
			
		Иначе
			ИсхДанныеТип = ТекущийОбъект.ТипИсходныхДанных;
			Элементы.ИсхДанныеСсылка.Видимость = Ложь;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Элементы.СтраницыИсхДанныеCнимокОбъекта.Доступность = ИсхДанныеРеквизиты.Количество() > 0;
	Элементы.СтраницаИсхДанныеТЧ.Видимость = Элементы.СтраницаИсхДанныеТЧ.ПодчиненныеЭлементы.Количество() > 0;
	Элементы.СтраницаИсхДанныеДопСвойства.Доступность = ИсхДанныеДопСвойства.Количество() > 0;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗначенияИсхДанныхСтруктуры(ТекущийОбъект, ИсходныеДанные)
	
	ИсхДанныеТип = ТекущийОбъект.ТипИсходныхДанных;
	Элементы.ИсхДанныеСсылка.Видимость = Ложь;
	
	ЗаполнитьЗначенияСтруктуры(ИсходныеДанные);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗначенияИсхДанныхОбъекта(ОбъектМД, ИсходныеДанные)
	
	Данные = Неопределено; // СправочникОбъектИмяСправочника, ДокументОбъектИмяДокумента
	Если Не ИсходныеДанные.Свойство("Данные", Данные) Тогда
		ВызватьИсключение НСтр("ru = 'Не удалось получить данные объекта'");
	КонецЕсли;
	
	Если кфкОбщегоНазначенияСлужебный.ЭтоСсылка(Данные) Тогда
		ИсхДанныеТип = ОбщегоНазначения.СтроковоеПредставлениеТипа(ТипЗнч(Данные));
		ИсхДанныеСсылка = Данные;
		Элементы.СтраницыИсхДанныеCнимокОбъекта.Доступность = Ложь;
		
	Иначе
		ТипСсылки = ОбщегоНазначения.СтроковоеПредставлениеТипа(ТипЗнч(Данные.Ссылка));
		ИсхДанныеТип = СтрЗаменить(ТипСсылки, "Ссылка.", "Объект.");
		ИсхДанныеСсылка = ?(Данные.ЭтоНовый(), Данные.ПолучитьСсылкуНового(), Данные.Ссылка);
		
		ОбъектМД = Данные.Метаданные();
		
		Для Каждого ИмяОбласти Из СтрРазделить("СтандартныеРеквизиты,Реквизиты", ",") Цикл
			Для Каждого Реквизит Из ОбъектМД[ИмяОбласти] Цикл // ОбъектМетаданныхРеквизит
				Если Реквизит.Имя = "Ссылка" Или Реквизит.Имя = "Ref" Тогда
					ДобавитьЗначениеИсхДанныхРеквизита(ИсхДанныеРеквизиты,
						Новый Структура(Реквизит.Имя, ИсхДанныеСсылка), Реквизит);
				Иначе
					ДобавитьЗначениеИсхДанныхРеквизита(ИсхДанныеРеквизиты, Данные, Реквизит);
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		
		Для Каждого ТабличнаяЧастьМД Из ОбъектМД.ТабличныеЧасти Цикл
			
			ТабличнаяЧасть = Данные[ТабличнаяЧастьМД.Имя]; // ТабличнаяЧасть
			Если ТабличнаяЧасть.Количество() = 0 Тогда
				Продолжить
			КонецЕсли;
			
			// ----------- ИНИЦИАЛИЗАЦИЯ РЕКВИЗИТОВ ФОРМЫ -----------
			ПоляНедопустимогоТипа = Новый СписокЗначений; // СписокЗначений Из Строка
			ИмяТаблицы = СтрШаблон("ИсхД_%1", ТабличнаяЧастьМД.Имя);
			// Реквизиты формы ТЧ
			Реквизиты = Новый Массив; // Массив Из РеквизитФормы
			Реквизиты.Добавить(Новый РеквизитФормы(ИмяТаблицы, Новый ОписаниеТипов("ТаблицаЗначений")));
			Для Каждого ИмяОбласти Из СтрРазделить("СтандартныеРеквизиты,Реквизиты", ",") Цикл
				Для Каждого Реквизит Из ТабличнаяЧастьМД[ИмяОбласти] Цикл // ОбъектМетаданныхРеквизит
					
					// Проверка на допустимость типа
					Если Реквизит.Тип.СодержитТип(Тип("ХранилищеЗначения")) Тогда
						ТипРеквизита = ОбщегоНазначения.ОписаниеТипаСтрока(20);
						ПоляНедопустимогоТипа.Добавить(Реквизит.Имя, НСтр("ru = '<ХранилищеЗначения>'"));
					Иначе
						ТипРеквизита = Реквизит.Тип;
					КонецЕсли;
					
					Реквизиты.Добавить(Новый РеквизитФормы(Реквизит.Имя, ТипРеквизита, ИмяТаблицы));
					
				КонецЦикла;
			КонецЦикла;
			ИзменитьРеквизиты(Реквизиты);
			// Страница элементов ТЧ
			Страница = Элементы.Добавить(СтрШаблон("СтраницаИсхД_%1", ТабличнаяЧастьМД.Имя), Тип("ГруппаФормы"),
				Элементы.СтраницаИсхДанныеТЧСтраницы);
			Страница.Вид = ВидГруппыФормы.Страница;
			Страница.Заголовок = СтрШаблон("%1 (%2)", ТабличнаяЧастьМД.Представление(), ТабличнаяЧасть.Количество());
			// Элемент ТЧ
			Таблица = Элементы.Добавить(ИмяТаблицы, Тип("ТаблицаФормы"), Страница);
			Таблица.ПутьКДанным = ИмяТаблицы;
			Таблица.ИзменятьСоставСтрок = Ложь;
			Таблица.ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиЭлементаФормы.Нет;
			Таблица.ПоложениеСтрокиПоиска = ПоложениеСтрокиПоиска.Верх;
			// Элементы колонок ТЧ
			Для Каждого ИмяОбласти Из СтрРазделить("СтандартныеРеквизиты,Реквизиты", ",") Цикл
				Для Каждого Реквизит Из ТабличнаяЧастьМД[ИмяОбласти] Цикл // ОбъектМетаданныхРеквизит
					Элемент = Элементы.Добавить(СтрШаблон("%1_%2", ИмяТаблицы, Реквизит.Имя), Тип("ПолеФормы"), Таблица);
					Элемент.ПутьКДанным = СтрШаблон("%1.%2", ИмяТаблицы, Реквизит.Имя);
					Элемент.Заголовок = Реквизит.Представление();
				КонецЦикла;
			КонецЦикла;
			
			// ----------- ЗАПОЛНЕНИЕ ТЧ -----------
			ДанныеТЧ = ЭтотОбъект[ИмяТаблицы]; // ТаблицаЗначений
			ИсключаемыеПоля = СтрСоединить(ПоляНедопустимогоТипа.ВыгрузитьЗначения(), ",");
			Для Каждого Строка Из ТабличнаяЧасть Цикл
				НоваяСтрока = ДанныеТЧ.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка, , ИсключаемыеПоля);
				Для Каждого Поле Из ПоляНедопустимогоТипа Цикл
					НоваяСтрока[Поле.Значение] = Поле.Представление;
				КонецЦикла;
			КонецЦикла;
			
		КонецЦикла;
		
		Для Каждого Свойство Из ИсходныеДанные.ДополнительныеСвойства Цикл
			ДобавитьЗначениеИсхДанныхСтруктуры(ИсхДанныеДопСвойства, Свойство);
		КонецЦикла;
		
	КонецЕсли;
	
	Элементы.ИсхДанныеСсылка.Видимость = ОбщегоНазначения.СсылкаСуществует(ИсхДанныеСсылка);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗначенияИсхДанныхРегистра(ОбъектМД, ИсходныеДанные)
	
	ИсхДанныеТип = СтрШаблон(НСтр("ru = 'Структура, описывающая запись регистра сведений ''%1'''"), ОбъектМД.Имя);
	Менеджер = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(ОбъектМД.ПолноеИмя()); // РегистрСведенийМенеджерИмяРегистраСведений
	ИсхДанныеСсылка = Менеджер.СоздатьКлючЗаписи(ИсходныеДанные); // РегистрСведенийКлючЗаписиИмяРегистраСведений
	
	// Проверка существования записи
	ИсхДанныеЗапись = Менеджер.СоздатьМенеджерЗаписи(); // РегистрСведенийМенеджерЗаписиИмяРегистраСведений
	ЗаполнитьЗначенияСвойств(ИсхДанныеЗапись, ИсхДанныеСсылка);
	ИсхДанныеЗапись.Прочитать();
	Элементы.ИсхДанныеСсылка.Видимость = ИсхДанныеЗапись.Выбран();
	
	ЗаполнитьЗначенияСтруктуры(ИсходныеДанные);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗначенияСтруктуры(ИсходныеДанные)
	
	Для Каждого КлючЗначение Из ИсходныеДанные Цикл
		
		Если КлючЗначение.Ключ = "ДополнительныеСвойства" И ТипЗнч(КлючЗначение.Значение) = Тип("Структура") Тогда
			Для Каждого Свойство Из КлючЗначение.Значение Цикл
				ДобавитьЗначениеИсхДанныхСтруктуры(ИсхДанныеДопСвойства, Свойство);
			КонецЦикла;
			
		Иначе
			ДобавитьЗначениеИсхДанныхСтруктуры(ИсхДанныеРеквизиты, КлючЗначение);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьЗначениеИсхДанныхСтруктуры(Приемник, Свойство)

	НоваяСтрока = Приемник.Добавить();
	НоваяСтрока.Имя = Свойство.Ключ;
	//@skip-check property-return-type
	НоваяСтрока.Значение = Свойство.Значение;
	НоваяСтрока.ТипЗначения = ОбщегоНазначения.СтроковоеПредставлениеТипа(ТипЗнч(Свойство.Значение));

КонецПроцедуры

&НаСервере
Процедура ДобавитьЗначениеИсхДанныхРеквизита(Приемник, Источник, Реквизит)

	НоваяСтрока = Приемник.Добавить();
	НоваяСтрока.Имя = Реквизит.Имя;
	//@skip-check property-return-type
	НоваяСтрока.Значение = Источник[Реквизит.Имя];
	НоваяСтрока.ТипЗначения = ОбщегоНазначения.СтроковоеПредставлениеТипа(ТипЗнч(Источник[Реквизит.Имя]));

КонецПроцедуры

&НаСервере
Функция ЭтоСтруктура(ТипСтрокой)
	
	Если ПустаяСтрока(ТипСтрокой) Тогда
		Возврат Ложь;
	
	Иначе
		Попытка
			Тип = Тип(ТипСтрокой);
		Исключение
			Возврат Ложь;
		КонецПопытки;
		
		Возврат Тип = Тип("Структура") Или Тип = Тип("ФиксированнаяСтруктура")
			Или Тип = Тип("Соответствие") Или Тип = Тип("ФиксированноеСоответствие");
		
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецОбласти
